In [1]:
# !pip install haversine

In [2]:
import pandas as pd
import haversine

In [3]:
df = pd.read_json('artists_shows_shard.json', lines=True)

In [4]:
print(df.shape)
df.head(3)

(15729, 3)

     artist                date                loc
0  2 Chainz 2019-06-30 05:30:00  Las Vegas, NV, US
1  2 Chainz 2019-07-12 11:00:00         London, UK
2  2 Chainz 2019-08-10 00:00:00    Anaheim, CA, US

The column named loc should be renamed to prevent confusion  
with the 'pandas.DataFrame.loc()' method

In [5]:
df.columns = ['artist', 'date', 'location']
df.head(3)

     artist                date           location
0  2 Chainz 2019-06-30 05:30:00  Las Vegas, NV, US
1  2 Chainz 2019-07-12 11:00:00         London, UK
2  2 Chainz 2019-08-10 00:00:00    Anaheim, CA, US

Trim shows outside US

In [6]:
domestic_df = df[df['location'].str.endswith('US')]
print(domestic_df.shape)
domestic_df.head(3)

(9608, 3)

     artist                date           location
0  2 Chainz 2019-06-30 05:30:00  Las Vegas, NV, US
2  2 Chainz 2019-08-10 00:00:00    Anaheim, CA, US
3  2 Chainz 2019-08-24 22:00:00    Atlanta, GA, US

Lets only make decisions based on shows with in the past five years.  
Trim any concerts before 2015.

In [7]:
recent_domestic_df = domestic_df[domestic_df.date >= '2015'].copy()
print(recent_domestic_df.shape)

(8642, 3)

### Lets merge/join some lat long info to these locations so we can compare them!

With some help from our friends at https://simplemaps.com/data/us-cities:  
We can get a csv of cities and their latititude and longitude from some census.

In [8]:
cities_df = pd.read_csv('uscitiesv1.5.csv')

In [9]:
print(cities_df.shape)
cities_df.head(2)

(37842, 16)

,city,city_ascii,state_id,state_name,county_fips,county_name,lat,lng,population,population_proper,density,source,incorporated,timezone,zips,id
0,Prairie Ridge,Prairie Ridge,WA,Washington,53053,Pierce,47.1443,-122.1408,NaN,NaN,1349.8,polygon,False,America/Los_Angeles,98360 98391,1840037882
1,Edison,Edison,WA,Washington,53057,Skagit,48.5602,-122.4311,NaN,NaN,127.4,polygon,False,America/Los_Angeles,98232,1840017314

Let's just grab city, state id, lat and lng.

In [10]:
cities_df = cities_df[['city', 'state_id', 'lat', 'lng']]
cities_df.head(2)

            city state_id      lat       lng
0  Prairie Ridge       WA  47.1443 -122.1408
1         Edison       WA  48.5602 -122.4311

Lets adjust these city and state values so they will match

In [11]:
cities_df.loc[:,'comb_city_state'] = cities_df['city'] + ', ' + cities_df['state_id'] + ', US'

In [12]:
cities_df.head()

             city state_id      lat       lng         comb_city_state
0   Prairie Ridge       WA  47.1443 -122.1408   Prairie Ridge, WA, US
1          Edison       WA  48.5602 -122.4311          Edison, WA, US
2        Packwood       WA  46.6085 -121.6702        Packwood, WA, US
3  Wautauga Beach       WA  47.5862 -122.5482  Wautauga Beach, WA, US
4          Harper       WA  47.5207 -122.5196          Harper, WA, US

In [13]:
combined = pd.merge(left=recent_domestic_df, right=cities_df,
             left_on='location', right_on='comb_city_state', how='left')

In [14]:
combined.head()

,artist,date,location,city,state_id,lat,lng,comb_city_state
0,2 Chainz,2019-06-30 05:30:00,"Las Vegas, NV, US",Las Vegas,NV,36.2291,-115.2607,"Las Vegas, NV, US"
1,2 Chainz,2019-08-10 00:00:00,"Anaheim, CA, US",Anaheim,CA,33.8390,-117.8572,"Anaheim, CA, US"
2,2 Chainz,2019-08-24 22:00:00,"Atlanta, GA, US",Atlanta,GA,33.7626,-84.4228,"Atlanta, GA, US"
3,2 Chainz,2019-05-27 05:30:00,"Las Vegas, NV, US",Las Vegas,NV,36.2291,-115.2607,"Las Vegas, NV, US"
4,2 Chainz,2019-05-19 00:00:00,"Detroit, MI, US",Detroit,MI,42.3834,-83.1024,"Detroit, MI, US"

Confirm shape matches old shape, no DUPs

In [15]:
recent_domestic_df.shape[0] == combined.shape[0]

True

Are there any missing values?

In [16]:
print(combined.shape)
combined.isna().sum()

(8642, 8)

artist               0
date                 0
location             0
city               276
state_id           276
lat                276
lng                276
comb_city_state    276
dtype: int64

Where is it failing to connect?

In [17]:
combined[combined['city'].isna()][:18]

,artist,date,location,city,state_id,lat,lng,comb_city_state
56,2 Chainz,2017-09-16 00:00:00,"St Petersburg, FL, US",NaN,NaN,NaN,NaN,NaN
68,2 Chainz,2017-08-30 01:00:00,"St Louis, MO, US",NaN,NaN,NaN,NaN,NaN
71,2 Chainz,2017-08-26 02:30:00,"St. Paul, MN, US",NaN,NaN,NaN,NaN,NaN
86,2 Chainz,2017-04-23 23:00:00,"Amherst, MA, US",NaN,NaN,NaN,NaN,NaN
87,2 Chainz,2017-04-22 19:00:00,"Pozo, CA, US",NaN,NaN,NaN,NaN,NaN
108,21 Savage,2019-07-31 01:00:00,"St. Paul, MN, US",NaN,NaN,NaN,NaN,NaN
147,21 Savage,2018-05-27 00:00:00,"Darien Center, NY, US",NaN,NaN,NaN,NaN,NaN
148,21 Savage,2018-05-24 23:00:00,"Mansfield, MA, US",NaN,NaN,NaN,NaN,NaN
176,21 Savage,2017-12-09 02:00:00,"St Louis, MO, US",NaN,NaN,NaN,NaN,NaN
198,21 Savage,2017-09-15 15:45:00,"Flushing, NY, US",NaN,NaN,NaN,NaN,NaN
208,21 Savage,2017-07-15 23:30:00,"St Petersburg, FL, US",NaN,NaN,NaN,NaN,NaN
212,21 Savage,2017-06-24 23:30:00,"St Petersburg, FL, US",NaN,NaN,NaN,NaN,NaN
259,3 Doors Down,2018-08-10 23:00:00,"Gilford, NH, US",NaN,NaN,NaN,NaN,NaN
410,5 Seconds of Summer,2019-09-29 23:00:00,"University Park, PA, US",NaN,NaN,NaN,NaN,NaN
413,5 Seconds of Summer,2019-10-06 00:00:00,"St. Paul, MN, US",NaN,NaN,NaN,NaN,NaN
430,5 Seconds of Summer,2019-11-09 01:00:00,"St Louis, MO, US",NaN,NaN,NaN,NaN,NaN
448,5 Seconds of Summer,2018-12-04 01:00:00,"St. Paul, MN, US",NaN,NaN,NaN,NaN,NaN
478,5 Seconds of Summer,2018-06-17 00:00:00,"Mansfield, MA, US",NaN,NaN,NaN,NaN,NaN

Won't get to all of these but probably can fix the 'saint's.  
How are they spelled in the csv?

In [18]:
cities_df[cities_df['city'].str.contains('Saint ')][:3]

               city state_id      lat       lng        comb_city_state
657      Saint John       WA  47.0915 -117.5887     Saint John, WA, US
1232  Saint Charles       VA  36.8052  -83.0575  Saint Charles, VA, US
1592     Saint Paul       VA  36.9069  -82.3164     Saint Paul, VA, US

In [19]:
print(cities_df[cities_df['comb_city_state'].str.contains('Saint ')].shape)
print(cities_df[cities_df['comb_city_state'].str.contains('St. ')].shape)
print(cities_df[cities_df['comb_city_state'].str.contains('St ')].shape)

(249, 5)
(1, 5)
(0, 5)

In [20]:
cities_df[cities_df['city'].str.contains('St. ')]

           city state_id   lat      lng   comb_city_state
33971  St. John       KS  38.0 -98.7611  St. John, KS, US

In the census csv, almost all the cities with 'Saint' in the name have it spelled out, not abbreviated ('St' or 'St.')  
Lets adjust the St John from the csv and then regularize these in our concert data

In [21]:
# Regularize cities csv "St. John Kansas"
cities_df.loc[:,'comb_city_state'] = cities_df['comb_city_state'].str.replace('St. ', 'Saint ')

In [22]:
cities_df[cities_df['comb_city_state'].str.contains('St. ')]

Empty DataFrame
Columns: [city, state_id, lat, lng, comb_city_state]
Index: []

In [23]:
print(recent_domestic_df[recent_domestic_df['location'].str.contains('Saint ')].shape)
print(recent_domestic_df[recent_domestic_df['location'].str.contains('St. ')].shape)
print(recent_domestic_df[recent_domestic_df['location'].str.contains('St ')].shape)

(20, 3)
(58, 3)
(73, 3)

In [24]:
recent_domestic_df.loc[:, 'location'] = recent_domestic_df['location'].str.replace('St. ', 'St ')
recent_domestic_df.loc[:, 'location'] = recent_domestic_df['location'].str.replace('St ', 'Saint ')

In [25]:
display(recent_domestic_df[recent_domestic_df['location'].str.contains('St. ')])
display(recent_domestic_df[recent_domestic_df['location'].str.contains('St ')])

Empty DataFrame
Columns: [artist, date, location]
Index: []

Empty DataFrame
Columns: [artist, date, location]
Index: []

In [26]:
combined = pd.merge(left=recent_domestic_df, right=cities_df,
             left_on='location', right_on='comb_city_state', how='left')

In [27]:
print(combined.shape)
combined.isna().sum()

(8642, 8)

artist               0
date                 0
location             0
city               145
state_id           145
lat                145
lng                145
comb_city_state    145
dtype: int64

In [28]:
n = 145
N = 8642 + 145
print(f'{n} out of {N}, or {1- round(n/N,2)}%... Not bad')

145 out of 8787, or 0.98%... Not bad

In [29]:
combined.dropna(inplace=True)   # Getting rid of those nan's

In [30]:
combined.head()

,artist,date,location,city,state_id,lat,lng,comb_city_state
0,2 Chainz,2019-06-30 05:30:00,"Las Vegas, NV, US",Las Vegas,NV,36.2291,-115.2607,"Las Vegas, NV, US"
1,2 Chainz,2019-08-10 00:00:00,"Anaheim, CA, US",Anaheim,CA,33.8390,-117.8572,"Anaheim, CA, US"
2,2 Chainz,2019-08-24 22:00:00,"Atlanta, GA, US",Atlanta,GA,33.7626,-84.4228,"Atlanta, GA, US"
3,2 Chainz,2019-05-27 05:30:00,"Las Vegas, NV, US",Las Vegas,NV,36.2291,-115.2607,"Las Vegas, NV, US"
4,2 Chainz,2019-05-19 00:00:00,"Detroit, MI, US",Detroit,MI,42.3834,-83.1024,"Detroit, MI, US"

In [31]:
combined['comb_lat_long'] = combined.lat.astype(str) + ', ' + combined.lng.astype(str)
# combined['comb_lat_long'] = combined['comb_lat_long'].str.split(', ')

In [32]:
combined.head()

,artist,date,location,city,state_id,lat,lng,comb_city_state,comb_lat_long
0,2 Chainz,2019-06-30 05:30:00,"Las Vegas, NV, US",Las Vegas,NV,36.2291,-115.2607,"Las Vegas, NV, US","36.2291, -115.2607"
1,2 Chainz,2019-08-10 00:00:00,"Anaheim, CA, US",Anaheim,CA,33.8390,-117.8572,"Anaheim, CA, US","33.839, -117.8572"
2,2 Chainz,2019-08-24 22:00:00,"Atlanta, GA, US",Atlanta,GA,33.7626,-84.4228,"Atlanta, GA, US","33.7626, -84.4228"
3,2 Chainz,2019-05-27 05:30:00,"Las Vegas, NV, US",Las Vegas,NV,36.2291,-115.2607,"Las Vegas, NV, US","36.2291, -115.2607"
4,2 Chainz,2019-05-19 00:00:00,"Detroit, MI, US",Detroit,MI,42.3834,-83.1024,"Detroit, MI, US","42.3834, -83.1024"

### Can we iterate over two artists?

In [43]:
from sklearn.neighbors import  NearestNeighbors

In [146]:
artist_df.loc[62]

location    Cincinnati, OH, US
lat                    39.1412
lng                   -84.5059
Name: 62, dtype: object

In [207]:
artists = combined['artist'].unique()
artists

'3 Doors Down'

In [209]:
main_artist = artists[4]
sim_artist = artists[6]
print('main: ', main_artist)
print('sim: ', sim_artists)

main:  5 Seconds of Summer
sim:  6LACK

In [237]:
main_artist_df = combined.loc[combined['artist']==main_artist,
                              ['location', 'lat', 'lng']]
main_artist_df.drop_duplicates(subset='location', inplace=True)
main_artist_df.reset_index(drop=True, inplace=True)    
                                                                        # concerts dataframe for main artist
print(main_artist_df.shape)
main_artist_df.head(2), main_artist_df.tail(2)

(59, 3)

(             location      lat      lng
 0  Cincinnati, OH, US  39.1412 -84.5059
 1      Boston, MA, US  42.3188 -71.0846,
                  location      lat      lng
 57  Silver Spring, MD, US  39.0028 -77.0207
 58  The Woodlands, TX, US  30.1738 -95.5134)

In [238]:
main_artist_places = main_artist_df['location'].unique()       
                                    # These are the unique string locations eg. 'Manhattan, NY, US'
# main_artist_places

In [248]:
nn = NearestNeighbors(n_neighbors=1, radius=1, n_jobs=-1, metric='cosine')     
nn.fit(main_artist_df[['lat', 'lng']],)                                  # Train nn to remember 2chainz lat longs

NearestNeighbors(algorithm='auto', leaf_size=30, metric='cosine',
                 metric_params=None, n_jobs=-1, n_neighbors=1, p=2, radius=1)

In [249]:
sim_artists_places = combined.loc[combined['artist']==sim_artist,'location'].unique()
# sim_artists_places

In [250]:
for place in sim_artists_places:                                                     # Iterate through 21 Savages unique cities
    if place not in main_artist_places:                                               # If town 2Chanz hasn't played there
                                                                                             # Get the lat lng and assign it to var
        place_latlong = combined.loc[combined['location']==place, ['lat', 'lng']][:1] # keep it 2D array
                                                                                            # for nn to predict on 
        print(place, '\n', place_latlong)


        distances, indices = nn.kneighbors(place_latlong, n_neighbors=5)
        for idx in indices:
            print(main_artist_df.loc[idx])
        print(distances, indices, '\n\n')
#         nn_distance, nn_index = distances[0][0], indices[0][0]
# #         print(nn_index)
# #         print(main_artist_df.reset_index(drop=True))
#         neighbor = main_artist_df.loc[nn_index]
        
#         print('\t-', place in main_artist_places, '-')
#         print('_Place_ : ', place)
#         print('_Place_latlong_ : ', place_latlong, '\n')
#         print('dist_to_nn: ', round(nn_distance, 4))
        
# #         print('nn_idx: ', nn_index)
#         print(neighbor.values)
#         print('\n')

Memphis, TN, US
         lat      lng
85  35.1047 -89.9773
           location      lat       lng
41  Seattle, WA, US  47.6211 -122.3244
27  Wichita, KS, US  37.6897  -97.3442
35   Tacoma, WA, US  47.2431 -122.4531
45   Rogers, AR, US  36.3173  -94.1514
12  Atlanta, GA, US  33.7626  -84.4228
[[2.71559496e-07 3.33082249e-06 7.13093821e-06 7.37188759e-06
  3.57263000e-05]] [[41 27 35 45 12]]


Huntington, WV, US
          lat      lng
595  38.4109 -82.4344
                location      lat      lng
0     Cincinnati, OH, US  39.1412 -84.5059
21  Indianapolis, IN, US  39.7771 -86.1458
4        Chicago, IL, US  41.8373 -87.6861
37      Rosemont, IL, US  41.9890 -87.8717
8       Columbus, OH, US  39.9860 -82.9852
[[2.61416609e-06 6.01751448e-06 4.17418659e-05 4.72598821e-05
  8.41609439e-05]] [[ 0 21  4 37  8]]


Landover, MD, US
          lat      lng
596  38.9241 -76.8875
                 location      lat      lng
57  Silver Spring, MD, US  39.0028 -77.0207
6      Pittsburgh, PA, US  40.4396 -79.9763
9      Washington, DC, US  38.9047 -77.0163
53         Vienna, VA, US  38.8996 -77.2597
3         Detroit, MI, US  42.3834 -83.1024
[[6.77966039e-09 1.15112520e-07 3.82648796e-07 2.41159696e-06
  4.48122849e-06]] [[57  6  9 53  3]]


Chapel Hill, NC, US
          lat     lng
597  35.9269 -79.039
                location      lat      lng
21  Indianapolis, IN, US  39.7771 -86.1458
0     Cincinnati, OH, US  39.1412 -84.5059
20    Louisville, KY, US  38.1662 -85.6488
47     Charlotte, NC, US  35.2079 -80.8303
4        Chicago, IL, US  41.8373 -87.6861
[[1.76826477e-05 2.54146492e-05 2.75935784e-05 1.25327791e-04
  1.72102194e-04]] [[21  0 20 47  4]]


Raleigh, NC, US
         lat      lng
44  35.8323 -78.6439
                location      lat      lng
21  Indianapolis, IN, US  39.7771 -86.1458
0     Cincinnati, OH, US  39.1412 -84.5059
20    Louisville, KY, US  38.1662 -85.6488
47     Charlotte, NC, US  35.2079 -80.8303
4        Chicago, IL, US  41.8373 -87.6861
[[1.27592500e-05 1.94324983e-05 3.46452467e-05 1.39902430e-04
  1.55893487e-04]] [[21  0 20 47  4]]


West Hollywood, CA, US
          lat       lng
210  34.0883 -118.3719
               location      lat       lng
40  Los Angeles, CA, US  34.1139 -118.4068
32    Inglewood, CA, US  33.9566 -118.3444
38       Carson, CA, US  33.8374 -118.2559
31    San Diego, CA, US  32.8312 -117.1226
30      Phoenix, AZ, US  33.5722 -112.0891
[[7.35233574e-09 4.66681288e-07 1.44359331e-06 2.51274363e-05
  5.63993809e-05]] [[40 32 38 31 30]]


Miami Beach, FL, US
        lat      lng
8  25.8171 -80.1396
                 location      lat       lng
13          Miami, FL, US  25.7840  -80.2102
34     Sacramento, CA, US  38.5667 -121.4683
58  The Woodlands, TX, US  30.1738  -95.5134
46      Las Vegas, NV, US  36.2291 -115.2607
19        Houston, TX, US  29.7868  -95.3905
[[1.99008843e-07 8.88769258e-06 1.60373267e-05 2.52656912e-05
  4.03711644e-05]] [[13 34 58 46 19]]


Albuquerque, NM, US
          lat       lng
170  35.1053 -106.6464
               location      lat      lng
16  New Orleans, LA, US  30.0687 -89.9288
13        Miami, FL, US  25.7840 -80.2102
44       Irving, TX, US  32.8584 -96.9702
17       Dallas, TX, US  32.7937 -96.7662
14        Tampa, FL, US  27.9937 -82.4454
[[1.09146121e-05 2.43641454e-05 3.78847693e-05 3.82426954e-05
  4.34776341e-05]] [[16 13 44 17 14]]


Oakland, CA, US
         lat       lng
75  37.7903 -122.2165
                 location      lat       lng
43     Sugar Land, TX, US  29.5965  -95.6293
18         Austin, TX, US  30.3006  -97.7517
33  San Francisco, CA, US  37.7562 -122.4430
19        Houston, TX, US  29.7868  -95.3905
42       San Jose, CA, US  37.3018 -121.8485
[[3.36208044e-08 2.45152521e-07 3.01437355e-07 3.87799034e-06
  3.94606057e-06]] [[43 18 33 19 42]]


Royal Oak, MI, US
          lat      lng
179  42.5084 -83.1539
                   location      lat      lng
3           Detroit, MI, US  42.3834 -83.1024
50  Rochester Hills, MI, US  42.6645 -83.1563
57    Silver Spring, MD, US  39.0028 -77.0207
6        Pittsburgh, PA, US  40.4396 -79.9763
9        Washington, DC, US  38.9047 -77.0163
[[4.43509604e-07 1.08847959e-06 7.29279142e-06 9.74773970e-06
  1.15697946e-05]] [[ 3 50 57  6  9]]


Millvale, PA, US
          lat      lng
623  40.4817 -79.9736
                 location      lat      lng
57  Silver Spring, MD, US  39.0028 -77.0207
6      Pittsburgh, PA, US  40.4396 -79.9763
9      Washington, DC, US  38.9047 -77.0163
53         Vienna, VA, US  38.8996 -77.2597
3         Detroit, MI, US  42.3834 -83.1024
[[1.33704879e-08 9.36300193e-08 3.42569062e-07 2.30930456e-06
  4.62328834e-06]] [[57  6  9 53  3]]


Cleveland, OH, US
          lat      lng
143  41.4767 -81.6805
                 location      lat      lng
57  Silver Spring, MD, US  39.0028 -77.0207
6      Pittsburgh, PA, US  40.4396 -79.9763
3         Detroit, MI, US  42.3834 -83.1024
9      Washington, DC, US  38.9047 -77.0163
53         Vienna, VA, US  38.8996 -77.2597
[[6.18507709e-07 1.45944173e-06 1.55775490e-06 2.21229098e-06
  5.86473842e-06]] [[57  6  3  9 53]]


Costa Mesa, CA, US
          lat       lng
314  33.6667 -117.9135
               location      lat       lng
38       Carson, CA, US  33.8374 -118.2559
32    Inglewood, CA, US  33.9566 -118.3444
40  Los Angeles, CA, US  34.1139 -118.4068
31    San Diego, CA, US  32.8312 -117.1226
30      Phoenix, AZ, US  33.5722 -112.0891
[[1.62561643e-07 8.49245048e-07 2.85755740e-06 1.16147971e-05
  8.30761171e-05]] [[38 32 40 31 30]]


Chula Vista, CA, US
          lat       lng
645  32.6281 -117.0145
               location      lat       lng
31    San Diego, CA, US  32.8312 -117.1226
38       Carson, CA, US  33.8374 -118.2559
32    Inglewood, CA, US  33.9566 -118.3444
40  Los Angeles, CA, US  34.1139 -118.4068
30      Phoenix, AZ, US  33.5722 -112.0891
[[9.37991477e-07 2.28458388e-05 2.80696987e-05 3.68080614e-05
  1.82007631e-04]] [[31 38 32 40 30]]


Maryland Heights, MO, US
          lat      lng
266  38.7188 -90.4749
               location      lat      lng
22  Saint Louis, MO, US  38.6358 -90.2451
47    Charlotte, NC, US  35.2079 -80.8303
11    Nashville, TN, US  36.1714 -86.7844
26  Kansas City, MO, US  39.1239 -94.5541
20   Louisville, KY, US  38.1662 -85.6488
[[1.03233523e-08 2.06645980e-05 4.48011409e-05 7.25354838e-05
  1.09995629e-04]] [[22 47 11 26 20]]


Tinley Park, IL, US
         lat      lng
648  41.567 -87.8051
               location      lat      lng
4       Chicago, IL, US  41.8373 -87.6861
37     Rosemont, IL, US  41.9890 -87.8717
8      Columbus, OH, US  39.9860 -82.9852
23      Madison, WI, US  43.0808 -89.3922
51  Minneapolis, MN, US  44.9635 -93.2678
[[4.61678930e-06 6.56621838e-06 2.36374640e-05 2.41154605e-05
  2.50260909e-05]] [[ 4 37  8 23 51]]


Noblesville, IN, US
          lat     lng
649  40.0353 -86.006
                location      lat      lng
0     Cincinnati, OH, US  39.1412 -84.5059
21  Indianapolis, IN, US  39.7771 -86.1458
4        Chicago, IL, US  41.8373 -87.6861
37      Rosemont, IL, US  41.9890 -87.8717
8       Columbus, OH, US  39.9860 -82.9852
[[1.81671875e-06 4.77021101e-06 4.52898440e-05 5.10304548e-05
  8.91684157e-05]] [[ 0 21  4 37  8]]


Clarkston, MI, US
          lat      lng
650  42.7359 -83.4188
                   location      lat      lng
50  Rochester Hills, MI, US  42.6645 -83.1563
3           Detroit, MI, US  42.3834 -83.1024
57    Silver Spring, MD, US  39.0028 -77.0207
6        Pittsburgh, PA, US  40.4396 -79.9763
9        Washington, DC, US  38.9047 -77.0163
[[1.80411736e-07 1.64998734e-06 1.10162176e-05 1.39927507e-05
  1.61603297e-05]] [[50  3 57  6  9]]


Burgettstown, PA, US
          lat      lng
652  40.3813 -80.3926
                 location      lat      lng
53         Vienna, VA, US  38.8996 -77.2597
9      Washington, DC, US  38.9047 -77.0163
6      Pittsburgh, PA, US  40.4396 -79.9763
57  Silver Spring, MD, US  39.0028 -77.0207
52        Allegan, MI, US  42.5299 -85.8462
[[4.51253479e-07 2.57955595e-06 3.55474514e-06 5.32235867e-06
  1.51811517e-05]] [[53  9  6 57 52]]


Hartford, CT, US
          lat      lng
653  41.7661 -72.6834
              location      lat      lng
2   Uncasville, CT, US  41.4345 -72.1098
1       Boston, MA, US  42.3188 -71.0846
56    New York, NY, US  40.6943 -73.9249
10    Brooklyn, NY, US  40.6501 -73.9496
7      Buffalo, NY, US  42.9017 -78.8487
[[2.15629070e-10 1.18918099e-04 1.68239978e-04 1.79425685e-04
  2.70343167e-04]] [[ 2  1 56 10  7]]


Camden, NJ, US
          lat      lng
655  39.9361 -75.1073
                location      lat      lng
39  Philadelphia, PA, US  40.0076 -75.1340
55     Allentown, PA, US  40.5961 -75.4756
49          York, PA, US  39.9651 -76.7315
48       Holmdel, NJ, US  40.3451 -74.1840
7        Buffalo, NY, US  42.9017 -78.8487
[[1.76648349e-07 1.14345395e-05 3.62772251e-05 4.42710963e-05
  4.61032999e-05]] [[39 55 49 48  7]]


Newark, NJ, US
          lat      lng
173  40.7245 -74.1725
             location      lat      lng
10   Brooklyn, NY, US  40.6501 -73.9496
56   New York, NY, US  40.6943 -73.9249
7     Buffalo, NY, US  42.9017 -78.8487
48    Holmdel, NJ, US  40.3451 -74.1840
55  Allentown, PA, US  40.5961 -75.4756
[[1.24218077e-07 6.03287928e-07 7.26222190e-06 8.01535655e-06
  3.72502470e-05]] [[10 56  7 48 55]]


Concord, CA, US
          lat       lng
662  37.9722 -122.0016
                 location      lat       lng
19        Houston, TX, US  29.7868  -95.3905
18         Austin, TX, US  30.3006  -97.7517
43     Sugar Land, TX, US  29.5965  -95.6293
33  San Francisco, CA, US  37.7562 -122.4430
46      Las Vegas, NV, US  36.2291 -115.2607
[[4.30635986e-07 6.68967815e-07 1.27616218e-06 3.46728964e-06
  3.93455219e-06]] [[19 18 43 33 46]]


Auburn, WA, US
          lat      lng
663  47.3041 -122.211
           location      lat       lng
27  Wichita, KS, US  37.6897  -97.3442
35   Tacoma, WA, US  47.2431 -122.4531
45   Rogers, AR, US  36.3173  -94.1514
41  Seattle, WA, US  47.6211 -122.3244
28   Denver, CO, US  39.7621 -104.8759
[[4.62860039e-09 6.04187170e-07 6.75741888e-07 1.88231402e-06
  2.39350893e-05]] [[27 35 45 41 28]]

In [80]:
combined.loc[combined['location']==place, ['lat', 'lng']][0:1]

        lat       lng
40  33.7366 -117.8819

In [ ]:
artist_latlongs_nx2
nn = NearestNeighbors(algorithm=n_neighbors=1, metric='haversine')

In [36]:
1 in pd.Series([1,2,3]), 'a' in pd.Series(['a', 'b', 'c'])

(True, False)

In [37]:
pd.__version__

'0.23.4'

In [189]:
test_matrix = [
    [0,0],
    [1,9],
    [5,5],
    [-1,0],
    [1,1],
    [-3,3]
]


nn = NearestNeighbors(n_neighbors=1)
nn.fit(test_matrix)
nn.kneighbors([[110,0]])

(array([[105.11898021]]), array([[2]]))